# CantPlaceInstanceError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CantPlaceInstanceError Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't place instance of [Symbol]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantPlaceInstanceError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantPlaceInstanceError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantPlaceInstanceError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace